Documents/Приложение2КНалоговойНакладной.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>Приложение2КНалоговойНакладной</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратОтПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговяНакладная</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НалоговаяНакладная</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьАвтор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОтветственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВозвратнаяНакладная</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВозвратОтПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЗаказано</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоОтклонение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоОтгружено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтруктурнаяЕдиница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСкидкиНаВес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Приложение2КНалоговойНакладной/Ext/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ФОРМЫ

Процедура ПечатьПриложение2КНалоговойНакладной(ТабличныйДокумент, Шапка, ВыборкаСтрокЗапасы)
	
	Если НЕ Шапка.Организация.ФинУчет Тогда
		Возврат;
	КонецЕсли;
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РасходнаяНакладная_Налоговая";
	
    Если Шапка.ДатаДокумента <= Дата("20140228") Тогда
		Макет = УправлениеПечатью.ПолучитьМакет("Документ.Приложение2КНалоговойНакладной.Приложение2КНалоговойНакладной2012");
    ИначеЕсли Шапка.ДатаДокумента <= Дата("20141130") Тогда
		Макет = УправлениеПечатью.ПолучитьМакет("Документ.Приложение2КНалоговойНакладной.Приложение2КНалоговойНакладной2014");
	Иначе
		Макет = УправлениеПечатью.ПолучитьМакет("Документ.Приложение2КНалоговойНакладной.Приложение2КНалоговойНакладной2014_2");
	КонецЕсли;
	
	НомерНалоговой = Прав("       "+СокрЛП(Число(Прав(Шапка.Номер, 5))), 7);
	
	КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм();	
	//Макет.КодЯзыкаМакета = КодЯзыкаПечать;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Оригинал");
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	
	_Дата = Формат(Шапка.ДатаДокумента, "ДФ=ddMMyyyy");
	Для Инд = 1 По 8 Цикл
		ОбластьМакета.Параметры["Дата_"+Инд]    = Сред(_Дата, Инд, 1);
	КонецЦикла;
	
	Номер = Прав("        "+СокрЛП(Число(Прав(Шапка.Номер, 5))), 8);
	Для Инд = 1 По 8 Цикл
		ОбластьМакета.Параметры["Номер_"+Инд]    = Сред(Номер, Инд, 1);
	КонецЦикла;
	
	_ДатаНалоговой = Формат(Шапка.НалоговаяНакладная.Дата, "ДФ=ddMMyyyy");
	Для Инд = 1 По 8 Цикл
		ОбластьМакета.Параметры["ДатаНалоговой_"+Инд]    = Сред(_ДатаНалоговой, Инд, 1);
	КонецЦикла;
	
	НомерНалоговой = Прав("       "+СокрЛП(Число(Прав(Шапка.НалоговаяНакладная.Номер, 5))), 7);
	Для Инд = 1 По 7 Цикл
		ОбластьМакета.Параметры["НомерНалоговой_"+Инд]    = Сред(НомерНалоговой, Инд, 1);
	КонецЦикла;
	
	
	
	// вынести получить данные организации и т.п.
	
	
	
	//ОбластьМакета.Параметры.ТекстЗаголовка = НСтр("ru='Расходная накладная № ';uk='Видаткова накладна № '", КодЯзыкаПечать)
	//			+ НомерДокумента
	//			+ НСтр("ru=' от ';uk=' від '", КодЯзыкаПечать)
	//			+ Формат(Шапка.ДатаДокумента, "Л="+КодЯзыкаПечать+"; ДФ='dd MMMM yyyy'");
		
	ОбластьМакета.Параметры.НазваниеОрганизации 	= СокрЛП(Шапка.Организация.ПолнНаименование);
	ОбластьМакета.Параметры.НазваниеКонтрагента		= СокрЛП(Шапка.Контрагент.ПолнНаим);
	ОбластьМакета.Параметры.АдресОрганизации		= СокрЛП(Шапка.Организация.ЮрАдрес);
	ОбластьМакета.Параметры.АдресКонтрагента		= СокрЛП(Шапка.Контрагент.ЮрАдрес);
	
	ФирмаНалогНомер = Прав("            " + СокрЛП(Шапка.Организация.ИНН), 12);
	ФирмаНомСвид	= Прав("          " + СокрЛП(Шапка.Организация.СвидетельствоСерияНомер), 10);
	ФирмаТелефоны	= СокрЛП(СтрЗаменить(Шапка.Организация.Телефоны,"-",""));
	
	Для Инд = 1 По 12 Цикл
		ОбластьМакета.Параметры["ИННОрганизации_"+Инд]    = Сред(ФирмаНалогНомер, Инд, 1);
	КонецЦикла;
	
	Попытка
		ОбластьМакета.Параметры["НомерСвидетельстваОрганизации"]    = ФирмаНомСвид;
	Исключение
	КонецПопытки;
	
	
	Для Инд = 1 По 10 Цикл
		ОбластьМакета.Параметры["ТелефоныОрганизации_"+Инд]    = Сред(ФирмаТелефоны, Инд, 1);
	КонецЦикла;
	
	КонтрагентНалогНомер	= Прав("            " + СокрЛП(Шапка.Контрагент.НомерПлательщикаНДС), 12);
	КонтрагентНомСвид		= Прав("          " + СокрЛП(Шапка.Контрагент.НомерСвидетельства), 10);
	КлиентТелефоны			= СокрЛП(СтрЗаменить(Шапка.Контрагент.Телефоны,"-",""));
	
	Для Инд = 1 По 12 Цикл
		ОбластьМакета.Параметры["ИННКонтрагента_"+Инд]    = Сред(КонтрагентНалогНомер, Инд, 1);
	КонецЦикла;
	
	Попытка
		ОбластьМакета.Параметры["НомерСвидетельстваКонтрагента"]    = КонтрагентНомСвид;
	Исключение
	КонецПопытки;
	
	
	Для Инд = 1 По 10 Цикл
		ОбластьМакета.Параметры["ТелефоныКонтрагента_"+Инд]    = Сред(КлиентТелефоны, Инд, 1);
	КонецЦикла;
	
	ОбластьМакета.Параметры.ВидДоговора = СокрЛП(Шапка.Контрагент.ВидДоговора);
	
	ДатаДоговора = Формат(Шапка.Контрагент.ДатаДоговора, "ДФ=ddMMyyyy");
	Для Инд = 1 По 8 Цикл
		ОбластьМакета.Параметры["ДатаДоговора_"+Инд]    = Сред(ДатаДоговора, Инд, 1);
	КонецЦикла;
	
	ОбластьМакета.Параметры.НомерДоговора	= СокрЛП(Шапка.Контрагент.НомерДоговора);
    ОбластьМакета.Параметры.ФормаРасчетов = "оплата з поточного рахунку";


	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ИтСуммаБезНДС	= 0;
	ИтСуммаНДС		= 0;
	ИтСумма			= 0;
	
	
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	
	ВыборкаСтрокЗапасы.Сбросить();
	Пока ВыборкаСтрокЗапасы.Следующий() Цикл
		
		//ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокЗапасы);
		
		ОбластьМакета.Параметры.ДатаКорректировки 	= Шапка.ДатаДокумента;
		ОбластьМакета.Параметры.Причина 			= "повернення товару";
		ОбластьМакета.Параметры.Номенклатура 		= ВыборкаСтрокЗапасы.Номенклатура.ПолнНаим;
		ОбластьМакета.Параметры.КодУКТВЭД 			= ВыборкаСтрокЗапасы.Номенклатура.КВЕД;
		ОбластьМакета.Параметры.ЕдиницаИзмерения	= ВыборкаСтрокЗапасы.Номенклатура.ЕдиницаИзмерения;
		ОбластьМакета.Параметры.ЦенаБезНДС			= -1*ВыборкаСтрокЗапасы.ЦенаБезНДС;
		
		ОбластьМакета.Параметры.ИзменениеКоличества = -1*ВыборкаСтрокЗапасы.Количество;
		ОбластьМакета.Параметры.ИзменениеСуммыБезНДС20 = -1*ВыборкаСтрокЗапасы.СуммаБезНДС;
		
		
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		
		ИтСуммаБезНДС	= ИтСуммаБезНДС + ВыборкаСтрокЗапасы.СуммаБезНДС;
		ИтСуммаНДС		= ИтСуммаНДС + ВыборкаСтрокЗапасы.СуммаНДС;
		ИтСумма			= ИтСумма + ВыборкаСтрокЗапасы.Сумма;
		
	КонецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Итоги");
	
	ОбластьМакета.Параметры.ИзменениеСуммыБезНДС20	= -1*ИтСуммаБезНДС;
	ОбластьМакета.Параметры.ИзменениеСуммыНДС		= -1*ИтСуммаНДС;
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьМакета.Параметры.Дата = Шапка.ДатаДокумента;
	ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = Шапка.Организация.ГлБухгалтер;
	
	ТабличныйДокумент.Вывести(ОбластьМакета);

КонецПроцедуры

Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ИмяМакета, КоллекцияПечатныхФорм)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_Приложение2КНалоговойНакладной";
	
	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Если ИмяМакета = "Налоговая" Тогда
			
			НалоговаяНакладная = Документы.НалоговаяНакладная.ПустаяСсылка();
			
			Если НЕ(ТекущийДокумент.Состав.Количество() = 0) Тогда
			
				Запрос = Новый Запрос(
				"ВЫБРАТЬ
				|	НалоговаяНакладнаяСостав.Ссылка
				|ИЗ
				|	Документ.НалоговаяНакладная.Состав КАК НалоговаяНакладнаяСостав
				|ГДЕ
				|	НалоговаяНакладнаяСостав.РасходняНакладная = &РасходнаяНакладная");
				
				Запрос.УстановитьПараметр("РасходнаяНакладная", ТекущийДокумент.Состав[0].ВозвратнаяНакладная.ДокОсн);
				
				РезультатЗапроса = Запрос.Выполнить();
				Если НЕ РезультатЗапроса.Пустой() Тогда
					Выборка = РезультатЗапроса.Выбрать();
					Выборка.Следующий();
					
					НалоговаяНакладная = Выборка.Ссылка;
					
				КонецЕсли;
				
			КонецЕсли;
			
			
			Запрос = Новый Запрос();
			Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
			Запрос.УстановитьПараметр("НалоговаяНакладная", НалоговаяНакладная);
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПриложениеКНалоговойНакладной.Дата КАК ДатаДокумента,
			|	ПриложениеКНалоговойНакладной.Номер,
			|	ПриложениеКНалоговойНакладной.Организация,
			|	ПриложениеКНалоговойНакладной.Подразделение,
			|	ПриложениеКНалоговойНакладной.Контрагент,
			|	ПриложениеКНалоговойНакладной.Запасы.(
			|		Ссылка,
			|		НомерСтроки КАК НомерСтроки,
			|		Номенклатура,
			|		ЕдиницаИзмерения КАК ЕдСокрНаим,
			|		Количество,
			|		Цена,
			|		Сумма,
			|		СтавкаНДС,
			|		СуммаНДС,
			|		Всего,
			|		КоличествоЗаказано,
			|		ПроцентСкидки,
			|		Скидка,
			|		СуммаБезСкидки,
			|		СтруктурнаяЕдиница,
			|		Номенклатура.ПолнНаим КАК ТоварПолнНаим,
			|		Номенклатура.Наименование КАК ТоварНаим,
			|		Номенклатура.Код КАК ТоварКод,
			|		ПриложениеКНалоговойНакладной.Запасы.Цена / 1.2 КАК ЦенаБезНДС,
			|		ПриложениеКНалоговойНакладной.Запасы.Сумма / 1.2 КАК СуммаБезНДС,
			|		Номенклатура.Вес,
			|		ПриложениеКНалоговойНакладной.Запасы.Сумма - ПриложениеКНалоговойНакладной.Запасы.Сумма / 1.2 КАК СуммаНДС
			|	),
			|	&НалоговаяНакладная
			|ИЗ
			|	Документ.Приложение2КНалоговойНакладной КАК ПриложениеКНалоговойНакладной
			|ГДЕ
			|	ПриложениеКНалоговойНакладной.Ссылка = &ТекущийДокумент
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки";
			
			Шапка = Запрос.Выполнить().Выбрать();
			Шапка.Следующий();
			
			НомерДокумента = Шапка.Номер;
			
			ВыборкаСтрокЗапасы = Шапка.Запасы.Выбрать();
			
			ПечатьПриложение2КНалоговойНакладной(ТабличныйДокумент, Шапка, ВыборкаСтрокЗапасы);
			
			ТабличныйДокумент.ОриентацияСтраницы=ОриентацияСтраницы.Ландшафт;
			ТабличныйДокумент.АвтоМасштаб=Истина;
			
			ТабличныйДокумент.ОриентацияСтраницы=ОриентацияСтраницы.Ландшафт;
			
		КонецЕсли;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатнаяФорма()


// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов,
				 ПараметрыПечати,
				 КоллекцияПечатныхФорм,
				 ОбъектыПечати,
				 ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Налоговая") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Налоговая", "Приложение 2", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "Налоговая", КоллекцияПечатныхФорм));
	КонецЕсли;
	
	
КонецПроцедуры
